app/Controllers/usuario_controller.php

  public function formValidation(){

    $input = $this ->validate ([
      'nombre' => 'required|min_length[3]',
      'apellido' => 'required|min_length[3]|max_length[25]',
      'usuario' => 'required|min_length[3]',
      'email' => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
      'pass' => 'required|min_length[3]|max_length[10]'
    ],
  );

  $formModel = new usuario_Model();
  if (!$input)
  {
    $data['titulo']='Registro';
    echo view('front/head_view',$data);
    echo view('front/navbar_view');
    echo view('back/registrar',['validation' => $this ->validator]);
    echo view('front/footer_view');

  } else {

    $formModel ->save ([
     'nombre' => $this ->request->getVar('nombre'),
      'apellido' => $this ->request->getVar('apellido'),
      'usuario' => $this ->request->getVar('usuario'),
      'email' => $this ->request->getVar('email'),
      'pass' => password_hash($this->request->getVar('pass'),PASSWORD_DEFAULT)
    ]);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `pass`) VALUES ('Juan ', 'Perez', 'JUAN23', 'Juan@gmail.com', '$2y$10$31OukPKOJRMo14MUXMmzOex8xI24sMgvUgGhgkr1dyQnX.SSQmI7K')